Artillery/Benchmark/load_test.yml
config:
  target: "{{ $processEnvironment.gateway_url }}"
  http:
    # Responses have to be sent within 10 seconds or the request will be aborted
    timeout: 10
  phases:
    - duration: 10
      arrivalRate: 1
  payload:

  # This is how data is loaded from multiple csv files in same test script
  -
    path: "/home/alpine/artifacts/B2/created_users.csv"
    fields:
      - "username"
      - "password"
      - "session_token"
      - "deploy_token"
    order: sequence
    skipHeader: true
  -
    path: "/home/alpine/artifacts/B2/created_repositories.csv"
    fields:
      - "repo_id"
      - "user"
    order: sequence
    skipHeader: true
  -
    path: "/home/alpine/artifacts/B2/created_artifact_ids.csv"
    fields:
      - "artifact_id"
    order: sequence
    skipHeader: true
  -
    path: "/home/alpine/artifacts/B2/created_artifact_datas.csv"
    fields:
      - "artifact_data"
    order: sequence
    skipHeader: true


### Endpoints to test against ###
  # List functions
  # Get function
  # Upload functions

scenarios:
  - flow:
    - get: # list artifacts
        url: "/repository/{repo_id}"
        cookie:
          - authtoken=: session_token

  - flow:
    - get: # get artifact
        url: "/artifact_download/{artifact_id}" # load from CSV
        # accourding to code for function the 'security' is implemented 
        #to get the id, not enforced on retrieval

  - flow:
    - post: # upload function
        url: "/artifact"
        json:
            Authorization: "{{ deploy_token }}"
        body: "{{ artifact_data }}"
        # gzip: true